In [3]:
#coding=utf-8
from pandas import Series,DataFrame
import pandas as pd
import numpy as np

pandas的俩个核心数据结构Series，DataFrame 
Series 和 DataFrame 分别对应于一维的序列和二维的表结构

In [124]:
s = Series(data=[1,2,3.0,'abc','df'])
s

0      1
1      2
2      3
3    abc
4     df
dtype: object

In [125]:
s = Series(data=[1,3,5,7],index = ['a','b','x','y'])
s

a    1
b    3
x    5
y    7
dtype: int64

In [126]:
s.index

Index([u'a', u'b', u'x', u'y'], dtype='object')

In [127]:
s.values

array([1, 3, 5, 7])

DataFrame 是一个表格型的数据结构，它含有一组有序的列（类似于 index），每列可以是不同的值类型（不像 ndarray 只能有一个 dtype）。基本上可以把 DataFrame 看成是共享同一个 index 的 Series 的集合。

In [1]:
data = {'state':['Ohino','Ohino','Ohino','Nevada','Nevada'],
        'year':[2000,2001,2002,2001,2002],
        'pop':[1.5,1.7,3.6,2.4,2.9]}

In [189]:
df = DataFrame(data)
df

   pop   state  year
0  1.5   Ohino  2000
1  1.7   Ohino  2001
2  3.6   Ohino  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [130]:
df = DataFrame(data,index=['one','two','three','four','five'],
               columns=['year','state','pop','debt'])

In [131]:
df

       year   state  pop debt
one    2000   Ohino  1.5  NaN
two    2001   Ohino  1.7  NaN
three  2002   Ohino  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

index and columns

In [143]:
list_tmp = list('abcdefg')
list_tmp

['a', 'b', 'c', 'd', 'e', 'f', 'g']

In [148]:
list_tmp.index('b')

1

In [154]:
ser = Series(list_tmp)
ser

0    a
1    b
2    c
3    d
4    e
5    f
6    g
dtype: object

In [155]:
ser[:2]

0    a
1    b
dtype: object

In [163]:
ser[ser=='a']

0    a
dtype: object

In [170]:
ser2 = Series([23,2,5,6])
ser2

0    23
1     2
2     5
3     6
dtype: int64

In [171]:
ser2.idxmax()

0

In [265]:
ser = Series([4.5,7.2,-5.3,3.6],index=['d','b','a','c'])
ser

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [182]:
a = ['a','b','c','d','e']
ser.reindex(a)

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [184]:
ser.reindex(a,fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

method:{'backfill', 'bfill', 'pad', 'ffill', None} 参数用于指定插值（填充）方式

In [5]:
data = {'Ohio':[0,3,6],
        'Texas':[1,4,7],
        'California':[2,5,8]}
df = DataFrame(data,index=['a','b','c'])
df

   California  Ohio  Texas
a           2     0      1
b           5     3      4
c           8     6      7

In [194]:
df.drop('a')

   California  Ohio  Texas
b           5     3      4
c           8     6      7

In [196]:
df.drop('Ohio', axis =1)

   California  Texas
a           2      1
b           5      4
c           8      7

In [197]:
foo = Series([4.5,7.2,-5.3,3.6],index=['d','b','a','c'])
foo

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [199]:
foo[:2]

d    4.5
b    7.2
dtype: float64

In [201]:
foo[:'a']

d    4.5
b    7.2
a   -5.3
dtype: float64

In [217]:
data = {'Ohio':[0,3,6],
        'Texas':[1,4,7],
        'California':[2,5,8]}
df = DataFrame(data,index=['a','b','c'])
df

   California  Ohio  Texas
a           2     0      1
b           5     3      4
c           8     6      7

In [221]:
df.ix[:2,:2]

   California  Ohio
a           2     0
b           5     3

In [218]:
df.ix['c']

California    8
Ohio          6
Texas         7
Name: c, dtype: int64

In [205]:
df.ix['a','California']

2

不使用ix;
索引时，选取的是列；
切片时，选取的是行；

In [6]:
#df['Ohio'] #df[df['Texas']>=4]
df[df['Texas']>=4]

   California  Ohio  Texas
b           5     3      4
c           8     6      7

In [211]:
df[:'b']

   California  Ohio  Texas
a           2     0      1
b           5     3      4

In [224]:
df.ix[:,df.ix['c']>=4]

   California  Ohio  Texas
a           2     0      1
b           5     3      4
c           8     6      7

算术运算和数据对齐

In [243]:
foo = Series({'a':1,'b':6})
foo

a    1
b    6
dtype: int64

In [237]:
bar = Series({'b':3,'d':4})
bar

b    3
d    4
dtype: int64

In [238]:
foo + bar

a    NaN
b    9.0
d    NaN
dtype: float64

In [239]:
foo.add(bar,fill_value=0) #sub div mul

a    1.0
b    9.0
d    4.0
dtype: float64

SORT
Series 的 sort_index(ascending=True) 方法可以对 index 进行排序操作，ascending 参数用于控制升序或降序，默认为升序。

若要按值对 Series 进行排序，当使用 .order(na_last=True, ascending=True, kind='mergesort') 方法，任何缺失值默认都会被放到 Series 的末尾。

在 DataFrame 上，.sort_index(axis=0, by=None, ascending=True) 方法多了一个轴向的选择参数与一个 by 参数，by 参数的作用是针对某一（些）列进行排序（不能对行使用 by 参数）：

In [245]:
s = Series(data=[1,3,5,7],index = ['b','a','x','y'])
s

b    1
a    3
x    5
y    7
dtype: int64

In [246]:
s.sort_index(ascending=True)

a    3
b    1
x    5
y    7
dtype: int64

In [255]:
data = {'Ohio':[0,3,6],
        'Texas':[1,4,7],
        'California':[9,5,8]}
df = DataFrame(data,index=['a','b','c'])
df

   California  Ohio  Texas
a           9     0      1
b           5     3      4
c           8     6      7

In [250]:
df.sort_index(by='Ohio',ascending=False)

   California  Ohio  Texas
c           8     6      7
b           5     3      4
a           2     0      1

In [253]:
df.sort_index(by=['California','Texas'])

   California  Ohio  Texas
b           5     3      4
a           8     0      1
c           8     6      7

In [256]:
df.sort_index(axis=1)

   California  Ohio  Texas
a           9     0      1
b           5     3      4
c           8     6      7

排名（Series.rank(method='average', ascending=True)）的作用与排序的不同之处在于，他会把对象的 values 替换成名次（从 1 到 n）。这时唯一的问题在于如何处理平级项，方法里的 method 参数就是起这个作用的，他有四个值可选：average, min, max, first

In [257]:
ser=Series([3,2,0,3],index=list('abcd'))
ser

a    3
b    2
c    0
d    3
dtype: int64

In [258]:
ser.rank()

a    3.5
b    2.0
c    1.0
d    3.5
dtype: float64

In [259]:
ser.rank(method='first')

a    3.0
b    2.0
c    1.0
d    4.0
dtype: float64

DataFrame 的 .rank(axis=0, method='average', ascending=True) 方法多了个 axis 参数，可选择按行或列分别进行排名，暂时好像没有针对全部元素的排名方法

In [260]:
data = {'Ohio':[0,3,6],
        'Texas':[1,4,7],
        'California':[9,5,8]}
df = DataFrame(data,index=['a','b','c'])
df

   California  Ohio  Texas
a           9     0      1
b           5     3      4
c           8     6      7

In [261]:
df.mean()

California    7.333333
Ohio          3.000000
Texas         4.000000
dtype: float64

In [262]:
df.mean(axis=1)

a    3.333333
b    4.000000
c    7.000000
dtype: float64

########################	*******************************************
count	非 NA 值的数量
describe	针对 Series 或 DF 的列计算汇总统计
min , max	最小值和最大值
argmin , argmax	最小值和最大值的索引位置（整数）
idxmin , idxmax	最小值和最大值的索引值
quantile	样本分位数（0 到 1）
sum	求和
mean	均值
median	中位数
mad	根据均值计算平均绝对离差
var	方差
std	标准差
skew	样本值的偏度（三阶矩）
kurt	样本值的峰度（四阶矩）
cumsum	样本值的累计和
cummin , cummax	样本值的累计最大值和累计最小值
cumprod	样本值的累计积
diff	计算一阶差分（对时间序列很有用）
pct_change	计算百分数变化